;-----------------------------------------
;--ЛР№6 Система обробки переривань--------
;----------------Група №5:----------------
;--Яремчук Д.В.--Митєв А.Ю.--Шевчук Д.Д.--		 		  
;-----------------------------------------

IDEAL			; Директива - тип Асемблера tasm 
MODEL SMALL		; Директива - тип моделі пам’яті 
STACK 512		; Директива - розмір стеку 

DATASEG
message db "IT-03. Yaremchuk Denis, Andrii Mitiev, Shevchuk Dania", 10, 13, '$'

exCode db 0

CODESEG
proc new_65h
		; Пересилання адреси рядка символів message в регістр dx
mov dx, offset message
		; Завантаження числа 09h до регістру ah
		; (Функція DOS 9h - команда виводу на консоль рядка)
mov ah,09h
int 21h	; Виклик функції DOS 9h
iret
endp new_65h
Start:
mov   ax,@data
mov   ds, ax 
                        ;Заповним вектор переривання користувача адресою нашого обробника
mov ah,25h            ;Функція заповнення вектора переривання 
mov al,65h            ;Номер вектора
mov dx, offset new_65h ;Зміщення прикладного обробника
push ds                 ;Збережемо DS
push cs                 ; Налаштуємо DS на сегмент команд
pop ds                  ;(там знаходить наш обробник)
int 21h               ;Викликаємо DOS
pop  ds               ;Відновлюємо DS

int 65h			; Викликаємо наше переривання

mov ah,04Ch
mov al,[exCode]   ; отримання коду виходу
int 21h           ; виклик функції 04ch  
;----------
END Start
;----------
